{
  "Execute binaries from npm packages.\n%s": "Executa comandos de módulos npm.\n%s",
  "Package to be installed.": "Pacote a ser instalado.",
  "Location of the npm cache.": "Localização da cache do npm.",
  "Skip installation if a package is missing.": "Pula a instalação se um pacote estiver faltando.",
  "Path to user npmrc.": "Caminho para o npmrc do usuário.",
  "Execute string as if inside `npm run-script`.": "Executa a string passada como se estivesse dentro de `npm run-script`.",
  "Shell to execute the command with, if any.": "Shell a ser usado para executar o comando, se houver.",
  "Generate shell code to use npx as the \"command not found\" fallback.": "Gera um código de shell que faz com que o npx seja usado em casos de \"comando não encontrado\".",
  "Ignores existing binaries in $PATH, or in the local project. This forces npx to do a temporary install and use the latest version.": "Ignora executáveis existentes no $PATH ou no projeto local. Isso força o npx a fazer uma instalação temporária e usar a versão mais recente.",
  "npm binary to use for internal operations.": "Executável do npm a ser usado em operações internas.",
  "For the full documentation, see the manual page for npx(1).": "Para a documentação completa, consulte a página de manual do npx(1).",
  "Unable to guess a binary name from %s. Please use --package.": "Não foi possível adivinhar um nome de executável correspondente a %s. Por favor, use --package.",
  "\nERROR: You must supply a command.\n": "\nERRO: Você deve informar um comando.\n",
  "Command failed: %s %s": "O comando falhou: %s %s",
  "Install for %s failed with code %s": "A instalação de %s falhou com o código %s",
  "%s not found. Trying with npx...": "%s não encontrado. Tentando com npx...",
  "command not found: %s": "comando não encontrado: %s",
  "options": "opções",
  "command": "comando",
  "version": "versão",
  "command-arg": "argumento-do-comando",
  "command-string": "string-de-comando",
  "shell": "shell",
  "package": "pacote",
  "npx: installed %s in %ss": "npx: instalou %s em %ss",
  "Suppress output from npx itself. Subcommands will not be affected.": "Omite a saída do npx. Subcomandos não serão afetados.",
  "Extra node argument when calling a node binary.": "Argumento extra do node ao chamar um executável do node.",
  "Always spawn a child process to execute the command.": "Sempre cria um processo filho para executar o comando."
}
